artifact = name: Windows.Sysmon.Detection
description: |
  Automated artifact for detection based on EQL.

  process where event.type in ("start", "process_started") and
    (process.pe.original_file_name == "wuauclt.exe" or process.name : "wuauclt.exe") and
     /* necessary windows update client args to load a dll */
     process.args : "/RunHandlerComServer" and process.args : "/UpdateDeploymentProvider" and
     /* common paths writeable by a standard user where the target DLL can be placed */
     process.args : ("C:\\Users\\*.dll", "C:\\ProgramData\\*.dll", "C:\\Windows\\Temp\\*.dll", "C:\\Windows\\Tasks\\*.dll")
parameters:
- name: SecurityEventsJSONPath
  description: Path to the security events file.
  default: Security-Datasets/aptsimulator_cobaltstrike_2021-06-11T21081492.json
sources:
- query: |-
    LET Events = SELECT parse_json(data=Line) AS EventData
    FROM parse_lines(filename=SecurityEventsJSONPath)

    LET SysmonGenerator <= generate(name="Sysmon",
    query={
     SELECT
      dict(
         Provider=dict(
            Name=EventData.SourceName,
            Guid=EventData.ProviderGuid),
         EventID=dict(
            Value=EventData.EventID
         ),
         Level=EventData.Level,
         Task=EventData.Task,
         TimeCreated=dict(
           SystemTime=timestamp(string=EventData.TimeCreated).Unix
         ),
         Execution=dict(
           -- ProcessId=TargetProcessId
         ),
         Channel=EventData.Channel,
         Computer=EventData.Hostname,
         Security=dict(
           UserID="" -- This seems to be missing?
         )
        ) AS System, EventData,
      EventData.Message AS Message
      FROM Events
    })

    LET ProcessTypes <= dict(`1`="start", `5`="stop")

    LET ProcessInfo = SELECT *,
      get(item=ProcessTypes, field=str(str=System.EventID.Value)) AS event_type
    FROM SysmonGenerator
    WHERE System.EventID.Value in (1, 5)

    SELECT EventData || UserData AS _EventData,
           System AS _System,
           EventData.UtcTime AS UtcTime,
           EventData.Image AS Image,
           EventData.ParentImage AS ParentImage,
           EventData.CommandLine AS CommandLine,
           EventData.User AS User,
           'defense_evasion_execution_lolbas_wuauclt.toml' AS Detection
    FROM ProcessInfo
    WHERE  ( event_type IN ('start', 'process_started' ) 
      AND  ( EventData.OriginalFileName = 'wuauclt.exe' OR EventData.Image =~ 'wuauclt\\.exe' ) 
      AND EventData.CommandLine =~ '/RunHandlerComServer'
      AND EventData.CommandLine =~ '/UpdateDeploymentProvider'
      AND EventData.CommandLine =~ 'C:\\\\Users\\\\.*\\.dll|C:\\\\ProgramData\\\\.*\\.dll|C:\\\\Windows\\\\Temp\\\\.*\\.dll|C:\\\\Windows\\\\Tasks\\\\.*\\.dll' )


output = [
 {
  "_EventData": {
   "RuleName": "-",
   "@timestamp": "2020-10-12T22:34:38.928Z",
   "ParentProcessGuid": "{71b87c12-d9fe-5f84-1701-000000000500}",
   "Channel": "Microsoft-Windows-Sysmon/Operational",
   "UserID": "S-1-5-18",
   "RecordNumber": 338555,
   "ThreadID": 3444,
   "Image": "C:\\Windows\\System32\\wuauclt.exe",
   "CurrentDirectory": "C:\\Users\\pgustavo\\Desktop\\",
   "IntegrityLevel": "High",
   "ProcessId": "6208",
   "Company": "Microsoft Corporation",
   "Version": 5,
   "Hostname": "WORKSTATION5.theshire.local",
   "Description": "Windows Update",
   "EventReceivedTime": "2020-10-12 18:34:38",
   "ProviderGuid": "{5770385F-C22A-43E0-BF4C-06F5698FFBD9}",
   "ParentProcessId": "3148",
   "UtcTime": "2020-10-12 22:34:38.157",
   "port": 61041,
   "Severity": "INFO",
   "tags": [
    "mordorDataset"
   ],
   "Task": 1,
   "TerminalSessionId": "2",
   "SourceModuleType": "im_msvistalog",
   "OpcodeValue": 0,
   "EventType": "INFO",
   "ExecutionProcessID": 3312,
   "Opcode": "Info",
   "SourceName": "Microsoft-Windows-Sysmon",
   "Product": "Microsoft速 Windows速 Operating System",
   "User": "THESHIRE\\pgustavo",
   "Keywords": -9223372036854775808,
   "FileVersion": "10.0.18362.1082 (WinBuild.160101.0800)",
   "LogonGuid": "{71b87c12-d426-5f84-263d-160000000000}",
   "EventID": 1,
   "Domain": "NT AUTHORITY",
   "Category": "Process Create (rule: ProcessCreate)",
   "CommandLine": "C:\\Windows\\System32\\wuauclt.exe  /UpdateDeploymentProvider C:\\ProgramData\\SimpleInjection.dll /RunHandlerComServer",
   "LogonId": "0x163d26",
   "OriginalFileName": "wuauclt.exe",
   "@version": "1",
   "AccountName": "SYSTEM",
   "ProcessGuid": "{71b87c12-d9fe-5f84-1901-000000000500}",
   "host": "wec.internal.cloudapp.net",
   "Hashes": "SHA1=2F40F94E713BC7D5759B15A15A2877014E27C05C,MD5=66A49AF6FA9EBC17ACF17313D0DE25E1,SHA256=A039511A553F9DA172468D4A0EB4552212A88AB9F0D0EE18CFEE7DDF2E2A9A2C,IMPHASH=BE9B473C189DDACB39D5DEE749A544E5",
   "SeverityValue": 2,
   "EventTime": "2020-10-12 18:34:38",
   "Message": "Process Create:\r\nRuleName: -\r\nUtcTime: 2020-10-12 22:34:38.157\r\nProcessGuid: {71b87c12-d9fe-5f84-1901-000000000500}\r\nProcessId: 6208\r\nImage: C:\\Windows\\System32\\wuauclt.exe\r\nFileVersion: 10.0.18362.1082 (WinBuild.160101.0800)\r\nDescription: Windows Update\r\nProduct: Microsoft速 Windows速 Operating System\r\nCompany: Microsoft Corporation\r\nOriginalFileName: wuauclt.exe\r\nCommandLine: C:\\Windows\\System32\\wuauclt.exe  /UpdateDeploymentProvider C:\\ProgramData\\SimpleInjection.dll /RunHandlerComServer\r\nCurrentDirectory: C:\\Users\\pgustavo\\Desktop\\\r\nUser: THESHIRE\\pgustavo\r\nLogonGuid: {71b87c12-d426-5f84-263d-160000000000}\r\nLogonId: 0x163D26\r\nTerminalSessionId: 2\r\nIntegrityLevel: High\r\nHashes: SHA1=2F40F94E713BC7D5759B15A15A2877014E27C05C,MD5=66A49AF6FA9EBC17ACF17313D0DE25E1,SHA256=A039511A553F9DA172468D4A0EB4552212A88AB9F0D0EE18CFEE7DDF2E2A9A2C,IMPHASH=BE9B473C189DDACB39D5DEE749A544E5\r\nParentProcessGuid: {71b87c12-d9fe-5f84-1701-000000000500}\r\nParentProcessId: 3148\r\nParentImage: C:\\Windows\\System32\\cmd.exe\r\nParentCommandLine: \"cmd.exe\" /c C:\\Windows\\System32\\wuauclt.exe /UpdateDeploymentProvider C:\\ProgramData\\SimpleInjection.dll /RunHandlerComServer",
   "SourceModuleName": "eventlog",
   "ParentImage": "C:\\Windows\\System32\\cmd.exe",
   "AccountType": "User",
   "ParentCommandLine": "\"cmd.exe\" /c C:\\Windows\\System32\\wuauclt.exe /UpdateDeploymentProvider C:\\ProgramData\\SimpleInjection.dll /RunHandlerComServer"
  },
  "_System": {
   "Provider": {
    "Name": "Microsoft-Windows-Sysmon",
    "Guid": "{5770385F-C22A-43E0-BF4C-06F5698FFBD9}"
   },
   "EventID": {
    "Value": 1
   },
   "Level": null,
   "Task": 1,
   "TimeCreated": {
    "SystemTime": null
   },
   "Execution": {},
   "Channel": "Microsoft-Windows-Sysmon/Operational",
   "Computer": "WORKSTATION5.theshire.local",
   "Security": {
    "UserID": ""
   }
  },
  "UtcTime": "2020-10-12 22:34:38.157",
  "Image": "C:\\Windows\\System32\\wuauclt.exe",
  "ParentImage": "C:\\Windows\\System32\\cmd.exe",
  "CommandLine": "C:\\Windows\\System32\\wuauclt.exe  /UpdateDeploymentProvider C:\\ProgramData\\SimpleInjection.dll /RunHandlerComServer",
  "User": "THESHIRE\\pgustavo",
  "Detection": "defense_evasion_execution_lolbas_wuauclt.toml"
 }
]