eql = process where event.type == "start" and
  (process.name : "sc.exe" or process.pe.original_file_name == "sc.exe") and
  process.parent.name : ("cmd.exe", "wscript.exe", "rundll32.exe", "regsvr32.exe",
                         "wmic.exe", "mshta.exe","powershell.exe", "pwsh.exe") and
  process.args:("config", "create", "start", "delete", "stop", "pause") and
  /* exclude SYSTEM SID - look for service creations by non-SYSTEM user */
  not user.id : "S-1-5-18"


query = 
        LET ProcessTypes <= dict(`1`="start", `5`="stop")

        LET ProcessInfo = SELECT *,
          get(item=ProcessTypes, field=str(str=System.EventID.Value)) AS event_type
        FROM SysmonGenerator
        WHERE System.EventID.Value in (1, 5)
        
SELECT EventData.UtcTime,EventData.Image,EventData.ParentImage,EventData.CommandLine,EventData.User,'lateral_movement_service_control_spawned_script_int.toml' AS Detection FROM ProcessInfo
WHERE  ( event_type = 'start'
  AND  ( EventData.Image =~ 'sc\\.exe' OR EventData.OriginalFileName = 'sc.exe' ) 
  AND EventData.ParentImage =~ 'cmd\\.exe|wscript\\.exe|rundll32\\.exe|regsvr32\\.exe|wmic\\.exe|mshta\\.exe|powershell\\.exe|pwsh\\.exe'
  AND EventData.CommandLine =~ 'config|create|start|delete|stop|pause'
  AND  NOT EventData.User =~ 'S-1-5-18' )  

output = [][][][][
 {
  "EventData.UtcTime": "2021-06-12 01:07:41.204",
  "EventData.Image": "C:\\Windows\\System32\\sc.exe",
  "EventData.ParentImage": "C:\\Windows\\System32\\cmd.exe",
  "EventData.CommandLine": "sc  create tbbd05 binpath= \"%%COMSPEC%% echo /c b6a1458f396 \u003e \\\\.\\pipe\\334485\" DisplayName= \"tbbd05\" start= demand",
  "EventData.User": "WORKSTATION5\\APT-Simulator",
  "Detection": "lateral_movement_service_control_spawned_script_int.toml"
 },
 {
  "EventData.UtcTime": "2021-06-12 01:07:41.224",
  "EventData.Image": "C:\\Windows\\System32\\sc.exe",
  "EventData.ParentImage": "C:\\Windows\\System32\\cmd.exe",
  "EventData.CommandLine": "sc  start tbbd05 ",
  "EventData.User": "WORKSTATION5\\APT-Simulator",
  "Detection": "lateral_movement_service_control_spawned_script_int.toml"
 },
 {
  "EventData.UtcTime": "2021-06-12 01:07:41.348",
  "EventData.Image": "C:\\Windows\\System32\\sc.exe",
  "EventData.ParentImage": "C:\\Windows\\System32\\cmd.exe",
  "EventData.CommandLine": "sc  stop tbbd05 ",
  "EventData.User": "WORKSTATION5\\APT-Simulator",
  "Detection": "lateral_movement_service_control_spawned_script_int.toml"
 },
 {
  "EventData.UtcTime": "2021-06-12 01:07:41.363",
  "EventData.Image": "C:\\Windows\\System32\\sc.exe",
  "EventData.ParentImage": "C:\\Windows\\System32\\cmd.exe",
  "EventData.CommandLine": "sc  delete tbbd05 ",
  "EventData.User": "WORKSTATION5\\APT-Simulator",
  "Detection": "lateral_movement_service_control_spawned_script_int.toml"
 }
]

eql = process where event.type in ("start", "process_started") and
  (process.pe.original_file_name == "wuauclt.exe" or process.name : "wuauclt.exe") and
   /* necessary windows update client args to load a dll */
   process.args : "/RunHandlerComServer" and process.args : "/UpdateDeploymentProvider" and
   /* common paths writeable by a standard user where the target DLL can be placed */
   process.args : ("C:\\Users\\*.dll", "C:\\ProgramData\\*.dll", "C:\\Windows\\Temp\\*.dll", "C:\\Windows\\Tasks\\*.dll")


query = 
        LET ProcessTypes <= dict(`1`="start", `5`="stop")

        LET ProcessInfo = SELECT *,
          get(item=ProcessTypes, field=str(str=System.EventID.Value)) AS event_type
        FROM SysmonGenerator
        WHERE System.EventID.Value in (1, 5)
        
SELECT EventData.UtcTime,EventData.Image,EventData.ParentImage,EventData.CommandLine,EventData.User,'defense_evasion_execution_lolbas_wuauclt.toml' AS Detection FROM ProcessInfo
WHERE  ( event_type IN ('start', 'process_started' ) 
  AND  ( EventData.OriginalFileName = 'wuauclt.exe' OR EventData.Image =~ 'wuauclt\\.exe' ) 
  AND EventData.CommandLine =~ '/RunHandlerComServer'
  AND EventData.CommandLine =~ '/UpdateDeploymentProvider'
  AND EventData.CommandLine =~ 'C:\\\\Users\\\\.*\\.dll|C:\\\\ProgramData\\\\.*\\.dll|C:\\\\Windows\\\\Temp\\\\.*\\.dll|C:\\\\Windows\\\\Tasks\\\\.*\\.dll' )  

output = [][][][][
 {
  "EventData.UtcTime": "2020-10-12 22:34:38.157",
  "EventData.Image": "C:\\Windows\\System32\\wuauclt.exe",
  "EventData.ParentImage": "C:\\Windows\\System32\\cmd.exe",
  "EventData.CommandLine": "C:\\Windows\\System32\\wuauclt.exe  /UpdateDeploymentProvider C:\\ProgramData\\SimpleInjection.dll /RunHandlerComServer",
  "EventData.User": "THESHIRE\\pgustavo",
  "Detection": "defense_evasion_execution_lolbas_wuauclt.toml"
 }
]